artillery/integrated.yml
config:
  target: "http://localhost:8080/api"
  phases:
  - duration: 60
    arrivalRate: 5
    name: Warm up

scenarios:
  - name: "register"
    flow:
      - post:
          url: "/auth/signup"
          json:
            userEmail : "{{userId}}"
            userPw : "{{userPw}}"
            nickName : "{{userNick}}"