artillery/registerLogin.yml
config:
  target: "http://localhost:8080/api"
  payload:
    path: "payload/account.csv"
    fields:
      - "userId"
      - "userPw"
      - "userNick"
  phases:
    - duration: 10
      arrivalRate: 1
      name: makeUserMax

scenarios:
  - name: "register and login"
    flow:
      - post:
          url: "/auth/signup"
          json:
            userEmail : "{{userId}}"
            userPw : "{{userPw}}"
            userPwChk : "{{userPw}}"
            nickName : "{{userNick}}"
      - post:
          url: "/auth/local"
          json:
            userEmail : "{{userId}}"
            userPw : "{{userPw}}"