artillery/saveChatlog.yml
config:
  target: "http://localhost:8080/api"
  payload:
    -
      path: "payload/account.csv"
      fields:
        - "userId"
        - "userPw"
        - "userNick"
    -
      path: "payload/count.csv"
      fields:
        - "count"
    -
      path: "payload/repeated_count.csv"
      fields:
        - "repeated_count"
  phases:
    - duration: 5
      arrivalRate: 1
      name: warm-up
before:
  flow:
    - log: "Get tokens"
    - post:
        url: "/auth/signup"
        json:
          userEmail : "moimtest@naver.com"
          userPw : "Password!001"
          userPwChk : "Password!001"
          nickName : "moimNick"
    - post:
        url: "/auth/local"
        json:
          userEmail : "moimtest@naver.com"
          userPw : "Password!001"
        capture:
          - json: "$.accessToken"
            as: "accessToken"
          - json: "$.refreshToken"
            as: "refreshToken"
scenarios:
  - name: "make-moim & chat & save-chatlog"
    flow:
      - post: #모임생성
          url: "/moims"
          headers:
            accessToken: "Bearer {{ accessToken }}"
            refreshToken: "Bearer {{ refreshToken }}"
          json:
            title : "{{count}}번 모임"
            contents : "{{count}}번 모임 컨텐츠"
            imgSrc : "testImgSrcData"
            location : "서울 영등포구 여의도동"
          capture:
            - json: "$.results[0].id"
              as: "productId"
      - post: #채팅방 생성
          url: "/moims/{{count}}/chatRoom"
          headers:
            accessToken: "Bearer {{ accessToken }}"
            refreshToken: "Bearer {{ refreshToken }}"
      # - post: #채팅 내용 저장
      #     url: "/moims/{{repeat_count}}/{{repeat_count}}"
      #     headers:
      #       accessToken: "Bearer {{ accessToken }}"
      #       refreshToken: "Bearer {{ refreshToken }}"
      #     json:
      #       contents : "{{count}}채팅 테스트 컨텐츠"
      #       url : "testImgSrcData"
      # - get: #채팅 조회
      #     url: "/moims/{{count}}/{{count}}"
      #     headers:
      #       accessToken: "Bearer {{ accessToken }}"
      #       refreshToken: "Bearer {{ refreshToken }}"