artillery/saveChatlog.yml
config:
  target: "http://localhost:8080/api"
  payload:
    -
      path: "payload/account.csv"
      fields:
        - "userId"
        - "userPw"
        - "userNick"
      order: sequence
    -
      path: "payload/count.csv"
      fields:
        - "count"
      order: sequence
    -
      path: "payload/repeated_count.csv"
      fields:
        - "repeated_count"
      order: sequence
  phases:
    - duration: 20
      arrivalRate: 5
      name: First phase - Warm up
    - duration: 30
      arrivalRate: 10
      name: Second phase - Ramp up load
    - duration: 40
      arrivalRate: 15
      name: Second phase - Sustained load
before:
  flow:
    - log: "Get tokens"
    - post:
        url: "/auth/signup"
        json:
          userEmail : "moimtest@naver.com"
          userPw : "Password!001"
          userPwChk : "Password!001"
          nickName : "moimNick"
    - post:
        url: "/auth/local"
        json:
          userEmail : "moimtest@naver.com"
          userPw : "Password!001"
        capture:
          - json: "$.accessToken"
            as: "accessToken"
          - json: "$.refreshToken"
            as: "refreshToken"
scenarios:
  - name: "make-moim & chat & save-chatlog"
    flow:
      - post: #모임 생성
          url: "/moims"
          headers:
            accessToken: "Bearer {{ accessToken }}"
            refreshToken: "Bearer {{ refreshToken }}"
          json:
            title : "{{count}}번 모임"
            contents : "{{count}}번 모임 컨텐츠"
            imgSrc : "testImgSrcData"
            location : "서울 영등포구 여의도동"
      - post: #채팅방 생성
          url: "/moims/{{count}}/chatRoom"
          headers:
            accessToken: "Bearer {{ accessToken }}"
            refreshToken: "Bearer {{ refreshToken }}"
      - post: #채팅 내용 저장
          url: "/moims/{{repeated_count}}/{{repeated_count}}"
          headers:
            accessToken: "Bearer {{ accessToken }}"
            refreshToken: "Bearer {{ refreshToken }}"
          json:
            contents : "{{count}}채팅 테스트 컨텐츠"
            url : "testImgSrcData"
      - get: #채팅 조회
          url: "/moims/{{count}}/{{count}}"
          headers:
            accessToken: "Bearer {{ accessToken }}"
            refreshToken: "Bearer {{ refreshToken }}"